先引入`pandas`数据库，用`pd`代称。

In [2]:
import pandas as pd

创建 DataFrame

In [3]:
S_ID = pd.Series(["01", "02", "03", "04", "05"])
S_Class = pd.Series(["二班", "一班", "二班", "三班", "一班"])
S_Grade = pd.Series([92, 67, 70, 88, 76])

DF1 = pd.DataFrame({"学号": S_ID, "班级": S_Class, "成绩": S_Grade})
DF1

   学号  班级  成绩
0  01  二班  92
1  02  一班  67
2  03  二班  70
3  04  三班  88
4  05  一班  76

创建`DataFrame`

In [4]:
L_ID = pd.Series(["01", "02", "03", "04", "05"])
L_Class = pd.Series(["二班", "一班", "二班", "三班", "一班"])
L_Grade = pd.Series([92, 67, 70, 88, 76])

DF2 = pd.DataFrame({"学号": L_ID, "班级": L_Class, "成绩": L_Grade})
DF2

   学号  班级  成绩
0  01  二班  92
1  02  一班  67
2  03  二班  70
3  04  三班  88
4  05  一班  76

创建有标签索引的`DataFrame`

In [9]:
S_ID1 = pd.Series(["01", "02", "03", "04", "05"],
                 index = ["小孙", "小黄", "小兔", "sed老师", "死矮子"])
S_Class1 = pd.Series(["二班", "一班", "二班", "三班", "一班"],
                 index = ["小孙", "小黄", "小兔", "sed老师", "死矮子"])
S_Grade1 = pd.Series([92, 67, 70, 88, 76],
                 index = ["小孙", "小黄", "小兔", "sed老师", "死矮子"])

DF3 = pd.DataFrame({"学号": S_ID1, "班级": S_Class1, "成绩": S_Grade1})
DF3

       学号  班级  成绩
小孙     01  二班  92
小黄     02  一班  67
小兔     03  二班  70
sed老师  04  三班  88
死矮子    05  一班  76

创建有标签索引的`DataFrame`

In [14]:
DF4 = pd.DataFrame({"学号": {"小孙": "01", "小黄": "02", "小兔": "03",
                    "sed老师": "04", "死矮子": "05"},
                    "班级": {"小孙": "二班", "小黄": "一班", "小兔": "二班",
                    "sed老师": "三班", "死矮子": "一班"},
                    "成绩": {"小孙": 92, "小黄": 67, "小兔": 70,
                    "sed老师": 88, "死矮子": 76}})
DF4

       学号  班级  成绩
小孙     01  二班  92
小黄     02  一班  67
小兔     03  二班  70
sed老师  04  三班  88
死矮子    05  一班  76

获得`FataFrame`的索引和列名

In [15]:
DF4.index

Index(['小孙', '小黄', '小兔', 'sed老师', '死矮子'], dtype='object')

In [16]:
DF4.columns

Index(['学号', '班级', '成绩'], dtype='object')

In [17]:
DF4.values

array([['01', '二班', 92],
       ['02', '一班', 67],
       ['03', '二班', 70],
       ['04', '三班', 88],
       ['05', '一班', 76]], dtype=object)

In [18]:
DF4.T

    小孙  小黄  小兔 sed老师 死矮子
学号  01  02  03    04  05
班级  二班  一班  二班    三班  一班
成绩  92  67  70    88  76

提取`DataFrame`的列

In [21]:
DF4['班级']

小孙       二班
小黄       一班
小兔       二班
sed老师    三班
死矮子      一班
Name: 班级, dtype: object

In [24]:
DF4.班级

小孙       二班
小黄       一班
小兔       二班
sed老师    三班
死矮子      一班
Name: 班级, dtype: object

In [22]:
DF4['成绩']

小孙       92
小黄       67
小兔       70
sed老师    88
死矮子      76
Name: 成绩, dtype: int64

In [23]:
DF4.成绩

小孙       92
小黄       67
小兔       70
sed老师    88
死矮子      76
Name: 成绩, dtype: int64

In [30]:
DF4[["学号", "成绩"]]

       学号  成绩
小孙     01  92
小黄     02  67
小兔     03  70
sed老师  04  88
死矮子    05  76

提取`DataFrame`里的行

In [32]:
DF4.loc["sed老师"]

学号    04
班级    三班
成绩    88
Name: sed老师, dtype: object

In [35]:
DF4.iloc[3]

学号    04
班级    三班
成绩    88
Name: sed老师, dtype: object

提取`DataFrame`里部分行

In [36]:
DF4.loc["小黄": "sed老师"]

       学号  班级  成绩
小黄     02  一班  67
小兔     03  二班  70
sed老师  04  三班  88

In [37]:
DF4.iloc[1:3]

    学号  班级  成绩
小黄  02  一班  67
小兔  03  二班  70

提取`DataFrme`里任意行

In [38]:
DF4.loc[["sed老师", "小黄"]]

       学号  班级  成绩
sed老师  04  三班  88
小黄     02  一班  67

In [39]:
DF4.iloc[[3, 1]]

       学号  班级  成绩
sed老师  04  三班  88
小黄     02  一班  67

提取某个`DataFrame`元素

In [40]:
DF4. loc["小兔", "学号"]

'03'

In [41]:
DF4. iloc[2, 0]

'03'

提取部分`DataFrame`

In [43]:
DF4.loc["小黄": "小兔", "班级": "成绩"]

    班级  成绩
小黄  一班  67
小兔  二班  70

In [42]:
DF4.iloc[1:3, 1:3]

    班级  成绩
小黄  一班  67
小兔  二班  70

In [45]:
DF4.loc[:, "班级": "成绩"]

       班级  成绩
小孙     二班  92
小黄     一班  67
小兔     二班  70
sed老师  三班  88
死矮子    一班  76

In [44]:
DF4.iloc[:, 1:3]

       班级  成绩
小孙     二班  92
小黄     一班  67
小兔     二班  70
sed老师  三班  88
死矮子    一班  76

In [46]:
DF4.loc[["小黄", "sed老师"], "学号": "班级"]

       学号  班级
小黄     02  一班
sed老师  04  三班

In [47]:
DF4.iloc[[1, 3], 0: 2]

       学号  班级
小黄     02  一班
sed老师  04  三班

根据条件筛选`DataFrame`的行

In [48]:
DF4[DF4["成绩"] > 80]

       学号  班级  成绩
小孙     01  二班  92
sed老师  04  三班  88

In [50]:
DF4[DF4. 成绩 > 80]

       学号  班级  成绩
小孙     01  二班  92
sed老师  04  三班  88

In [51]:
DF4[(DF4["成绩"] > 80) & (DF4["班级"] == "三班")]

       学号  班级  成绩
sed老师  04  三班  88

获得`DataFrame`的前 N 行

In [52]:
DF4.head()

       学号  班级  成绩
小孙     01  二班  92
小黄     02  一班  67
小兔     03  二班  70
sed老师  04  三班  88
死矮子    05  一班  76

In [53]:
DF4.head(2)

    学号  班级  成绩
小孙  01  二班  92
小黄  02  一班  67

提取`DataFrame`的列

In [26]:
DF5 = pd.DataFrame({"学号": {"小孙": "01", "小黄": "02", "小兔": "03",
                    "sed老师": "04", "死矮子": "05"},
                    "班级": {"小孙": "二班", "小黄": "一班", "小兔": "二班",
                    "sed老师": "三班", "死矮子": "一班"},
                    "成绩 - 期末": {"小孙": 92, "小黄": 67, "小兔": 70,
                    "sed老师": 88, "死矮子": 76}})
DF5

       学号  班级  成绩 - 期末
小孙     01  二班       92
小黄     02  一班       67
小兔     03  二班       70
sed老师  04  三班       88
死矮子    05  一班       76

In [27]:
DF5.成绩 - 期末

AttributeError: 'DataFrame' object has no attribute '成绩'

In [29]:
DF5["成绩 - 期末"]

小孙       92
小黄       67
小兔       70
sed老师    88
死矮子      76
Name: 成绩 - 期末, dtype: int64